Repository: mozilla-l10n/mt-training-data
Catalog: trw/trw_pontoon.tmx
Source language: en_us
Languages: trw

source: If you could <strong>hear them</strong> and <strong>understand them</strong>, it’s usually <strong>best to approve</strong>.
trw: کو کوبھادُو <strong> مھأ بُھوش </strong> آں <strong> ای ما آمن جنا</strong>۔ غورا ہودُو منظورو <strong>

source: If you don’t hear from us within a couple of days, reach out at <emailLink>{ $email }</emailLink> and we’ll get back to you!
trw: کو تأ مھو یے ما اے دو دیا می کی نُو بُود بھی تھلا مھو سیت <emailLink> مے ای میل دے رابطہ کو مھو یے تھأ شیِدانیِن!

source: If you or your organisation would like to contribute back to the project, you can make a <donateLink>donation</donateLink> or reach out to our partnerships team on <emailFragment>commonvoice@mozilla.com</emailFragment>.
trw: کو تُو یا چھی تنظیم اے منصوبہ یے کی دندہ دیؤ نئِمادُو تُو مھید <donateLink> ڈونیشن دے بھادُو </donateLink> یا مُھن دأال سأدا سی ٹیم گے مھید <emailFragment><emailFragment> ای میل دے تُنُو بن بھادُو۔ commonvoice@mozilla.com</emailFragment>

source: If you’re having trouble contributing, you can switch back to seeing all content for your language at any time.
trw: کو تھے یے مھیرے دئی مواد تھلُو می بُکھاد تُھو پشن کے بش آں بھی کامے ٹیما مھید کے دُوآر یے۔

source: If you’re looking for tools to build ASR models, you can connect to other people in the community <discourseLink>on Discourse</discourseLink>.
trw: کو تُو مھال شیئی بھیراڑُودُو کیندے یأمنے ASR ماڈل سوابیَدیدا تُو مُھن مے سائٹ زید دأل خلگا سیت میِل بھادُو <discourseLink> آں بات کوبھادُو۔</discourseLink>

source: If you're looking to speak more about the dataset, want to co-invest in planned platform expansions or look for collaboration opportunities, <emailFragment>drop us a line.</emailFragment>
trw: کو تھو مے ڈیٹا سیٹ سی بارا می کی بنُو نیِمادی یا مے پروگرام سی گھینی او کھولاؤ کؤ نیِمادی یا شراکت سی کیا موقع بھیرڑدی تھلا مھو یے مھید <emailFragment> ایک دُو ڇیڙ لیِگا۔

source: If you run out of sentences to review, please help us collect more sentences!
trw: کو تھے کیش بھی بُو سی کیا جملا نی تھیو توُ مھید مُھن مدد کو دأل جملا سی دیئو سی کیا!

source: If you think the pronunciation makes it <strong>impossible to understand</strong>, or there’s a <strong>lot of background noise</strong>, or there are <strong>other people speaking too</strong>, then you should reject the clip. <accuracyLink>See more information in our accuracy criteria</accuracyLink>.
trw: کو چھی خیال دے تلفظ <strong> سی جنُو چیر گن بوکھو تُھو </strong> یا ہید کآں <strong> پاش کے گ شور تُھو </strong> یا ہید دأل خلگ <strong> بأت کودی </strong> تھلا اے کلپ رد کو۔ <accuracyLink> مھید اے بارا می آں ٹھیک ہؤ سی کیا دأل معلومات ہُم بُو۔ </accuracyLink>

source: Igbo
trw: ایگبو

source: I just created a personal goal for voice donation to #CommonVoice -- join me and help teach machines how real people speak { $link }
trw: مأ مھیرے مھیرے کامن وائس کے آوازا سی دیؤ سی کیا اے مقصد آمن گے تھیئی۔ مھے سیت مدد کو آں مشین گے بنا کھأکأ اصل خلگ بنَدی۔ { $link }

source: I'm okay with you handling this info as you explain in Mozilla's <privacyLink>Privacy Policy</privacyLink>
trw: مھے یے موزیلا می مے معلومات سی دیؤ دے کی مسلہ نُو تُھو۔ <privacyLink> آ پرائیوسی پالیسی ما شیِد تُھو۔

source: Include appropriate citation
trw: سہی حوالہ می یے تھلا

source: Includes email, username & demographic info, available right away
trw: ای می ای میل، یوزرنام آں ابادی وغیرہ سی معلومات مھیرے موجود تھی

source: Includes mp3s and related sentences, may take some time to prepare
trw: ای می ایم پی 3 آں ہال جملا تھی۔ تیا کؤ سی کیا دھأک وقت پکار تُھو

source: Indonesian
trw: انیڈونیشی

source: Information about the language
trw: اے جیِب سی بارا می معلومات

source: In Progress
trw: لا کام ہودُو

source: Interested in getting involved with this project, or partnering with us?
trw: مھو سیت مے پراجیکٹ می حصّہ گھینُو نیِمادُو یا مھو سیت شریک ہودُو؟

source: Interested in learning more and contributing to the project?
trw: تُو دیئی جنُو می آں مے پراجیکٹ می مدد کؤ نیِمادُو؟

source: Interface language:
trw: استعمال سی جیِب

source: Interlingua
trw: انٹرلینگوا

source: Interlingue
trw: انٹرلینگو

source: [interrupted by background noise]
trw: [میدے کآم مخل ہُو پأشا]

source: Intersex
trw: مئمو سی جنس

source: Invalid file
trw: غلط فائل

source: Irish
trw: آئری

source: IsiNdebele (North)
trw: ایسی نڈیبیلی (شمالی)

source: IsiNdebele (South)
trw: ایسی نڈیبدیبیلی (جنوبی)

source: <isoCodeLink>ISO Codes</isoCodeLink> if known
trw: <isoCodeLink>ایسی ائی ایس او کوڈ </isoCodeLink> کو معلوم تُھوو

source: Is the clip valid?
trw: کلپ برابر چھی؟

source: Italian
trw: ایٹیلیی

source: It contains words or phrases that are hard to read or pronounce.
trw: ای می مھال فقرہ یا ٹگیل تھی تھیِن بنُو بُوکھو تُھو۔

source: It costs almost a million dollars a year to host the datasets and improve the platform for the 100+ language communities who rely on what we do?
trw: اے کال می مے ڈیٹا سیٹ سی ڙݜُو آں ایس سو ما زیئاد جیِبا سی کیا غورا کؤ می دش لکھ ڈالرے خرچہ تُھو؟

source: It costs almost a million dollars a year to host the datasets and improve the platform for the 100+ language communities who rely on what we do. <strong>If you value open, inclusive data - donate today!</strong>
trw: مے مواد سی ڈیتا سیٹ سی گھیِنُو آں ایس غورا کؤ سی کی کال می پائں سو لکھے ڈالرز ݜیَدی کئی کے ای می سؤ ما چیر جیِب تھی آں تھیِن خلگ تھی سے مُھن کم زید انحصار کودی۔ کو مھو کھولاؤ، ہر ایکے آویل ہودیو مھو یے دا۔

source: It costs a lot of money to continually host and release the datasets, improve the platform and run <africaMradiLink>community programmes</africaMradiLink>.
trw: ڈیٹا سیٹ سی باش کؤ آں شائع کؤ می چیر پیس ݜیَدی آں ہامُوڑ یی ایِسی بہتر کؤ می آں ایسی ٹین گے <africaMradiLink> کمیوںیٹیا سی پروگرام چلؤ می گن پیس پھورودی۔ </africaMradiLink>

source: It is very important that all text sentences are <publicDomain>public domain</publicDomain> (cc0) as the Common Voice dataset is released under a cc0 license. Only ever upload a sentence if you are sure, and always include the relevant citation.
trw: اے چیر اہم بات چھی یرأ بُوڑ جملہ ہر ایک سی کیا ہُوئن <publicDomain> تیس کے پبلک ڈومین </publicDomain> سی cc0 کامک تے یأ کام وائس سی ڈیٹا سیت cc0 لیسن دے ہوییا دا۔ تھأ جملہ تھلا کامکا سی بارا می تھو یے تیسی بناڑ سی یا لیِگاڑ سی پتا ہیو آں بھی تھیِن ٹیک حوالہ دا۔

source: It is written in a language different than what I’m reviewing.
trw: ہے مھالے جیِب می لیگیل چھی سے مھی جیِب ما بدل چھی۔

source: It is written in a language different than what I’m speaking.
trw: ہے مھالے جیِب می لیِگیل چھی سے مھی جیِب ما دھأل چھی۔

source: It’s important to include citations so we can check that sentences are in the public domain and no copyright restriction apply.
trw: حوالہ سی دیؤ چیر ضروری تُھو۔ این دے مھو تھأ جملہ عوام سی ہر ایک سی کی دے بھادی آں ای می کاپی رائیٹا سی مسلہ نہ ہودُو۔

source: It takes a lot to make Common Voice happen! We don't do it alone. Want to partner with us? We'd love to hear from you.
trw: کامن وائس سی کامأبی سی کیا چیر کآں کؤ ہودُو! مھو ایس آمن سیت نہ کودی۔ تھو مھو سیت شریک ہؤنیِمادی؟ مھو یے تھو یے ما بُھویُو تُھو۔

source: Izhorian
trw: ازہوری

source: Japanese
trw: جاپانی

source: Javanese
trw: جاوی

source: Join Discord Community
trw: دیسکارڈ کمیونیٹی می آمن میِلا

source: Join the Common Voice mailing list
trw: کان وائس سی ای میلا سی لسٹ می آمن میِلا۔

source: Join us on Discord
trw: مھو سیت دیسکاڑد می میِل

source: Just respond to the prompt as naturally as you can in a couple of sentences. Make sure your language is respectful and inoffensive.
trw: ای دُو جملا می مے پرامپٹ سی جواب دا کو دے بھادیو۔ یقین کو یرأ کامے جیِب تھو استعمال کودیدا سے بے ادبا آں بے ہُودا نہ ہوئے

source: Just Unsure?
trw: یقین نُو تُھو کھأ؟

source: Kabardian
trw: کبارڈی

source: Kabyle
trw: کبیل

source: Kalenjin
trw: کلیجین

source: Kannada
trw: کںاڈا

source: Kaqchikel
trw: کپچیکیل

source: Karakalpak
trw: کراکلپاک

source: Kazakh
trw: کزاخ

source: { $kb }kb max
trw: { $kb }کے بی میکس

source: Keep
trw: چھودپو مھید

source: Keep it up, record again <recordIcon></recordIcon>
trw: أئں ہامُوڑ، بھی ریکارڈ کو۔ <recordIcon>

source: Keep the recordings
trw: ریکارڈنگ مھید تھا

source: Keep track of your progress and metrics across multiple languages.
trw: چیر جیِبا می تُنُو کم سی نھیِگالُو آں ای سی شمار پیانُو سی کیا آمن گے پان تھا۔

source: Keep track of your progress with a profile
trw: تُنُو کم سی مو نھیِگالُو سی کیا خاکہ می بُوا۔

source: Keep track of your progress with a profile and help our voice data be more accurate.
trw: پروافائل دے تُنو کم سی پراگریس بُو آں ڈیٹا سیٹ سی کیا ٹیک کؤ می مدد کو۔

source: Kelabit
trw: کیلابیٹ

source: Kenyah
trw: کینیاہ

source: Khmer
trw: خیمر

source: K'iche'
trw: کیشے

source: Kichwa
trw: کیچاؤ

source: Kidaw'ida
trw: کیدوادیا

source: Kikuyu
trw: کیکیُو

source: Kinyarwanda
trw: کینیارونڈا

source: Kom
trw: کوم

source: Komi-Zyrian
trw: کومی زیری

source: Konkani (Devanagari)
trw: کونکانی (دیوناگری)

source: Korean
trw: کوریائی

source: Kurmanji Kurdish
trw: کُمرانجی کردی

source: Kyrgyz
trw: کیرغیز

source: Language
trw: جیِب

source: Language Fundamentals (e.g. Digits, Letters, Money)
trw: جیِب سی بارا می (ہندسہ، حروف، پیش)

source: Language Request
trw: جیِب سی کیا أرضی

source: Language request successfully submitted, thank you.
trw: جیِنب سی کیا أرضی کامیابی دے تھلا گأ، مہربأنگی

source: Languages
trw: جیِب

source: Languages can have their own validation rules with additional requirements when they localize. If there is no specific validation file for a language, the English rules will show for contributors.
trw: جیِا سی تُنُو طریقا ہودی کے یأ ہے ترجمہ ہؤسأدو آں کو کامے جیِب سی کیا کی کسوٹی چھیو تیندے چیک کوا بیے کامک زید ٹول کام کوئن والا متفق تھیو۔

source: Language Text
trw: جیِب سی لیِکھ

source: Lao
trw: لاؤ

source: Large bulk sentence submission
trw: جملا سی پھان تھلُو

source: Large scale corporates and platform companies
trw: گھین گھین کمپنی آں پلیٹ فارمز

source: Last Updated: { $lastUpdatedTimeStamp }
trw: آخیری گونا آپڈیٹ کوئل

source: Latgalian
trw: لٹاگلی

source: Latvian
trw: لتوی

source: Launched
trw: سوابیشتے تھلا گأ

source: Laz
trw: لاز

source: Leaderboard Visibility
trw: لیڈر بورڈ زید کھال پشؤ نیِمادُو

source: Learn about partnerships with Common Voice
trw: کامن وائس سیت شراکت سی بارا می آمن جنا

source: Learn how to check a transcription
trw: ٹرانسکریپشن سی چیک کؤ سی چیک کؤِ چھیِڙا

source: Learn how to take part
trw: شامل ہؤ سی کیا چھیِڙا

source: Learn how to transcribe
trw: ٹرانسکرائب/آڈیو سی لیِگو ما آمن جنا

source: Learn how to use this page
trw: مے پاݜ سی استعمال چھیِڙا

source: Learn More
trw: اے بارا می دیئ چھیِڙا

source: Leaving now means you’ll lose your changes
trw: مھیرے مھیدا بیُو دے تُو تُنو بدل کوئیل شیئی ہڙابھادُو

source: Leaving now means you'll lose your progress
trw: مھیرے مے سائٹ ما بیُو دے تأ تُنو کام ہڙانیِن

source: Length
trw: ڙیگا چا

source: Let's Get Started
trw: یا شروع کیئ

source: Letters must be valid in the language being spoken. For example, “ж” is a letter in the Russian alphabet but is never used in English and so should never appear in any English source text.
trw: کامے جیِب یأ چھیِدا تی می حروف صحیح ہوئین۔ خو اے جیِب می دئی جیِب سی حروف تھلُو پکار نُو تُھو۔ مثال دے توروالی جملہ می e.g سی لیگُو پکار نُو تُھو۔

source: LibriSpeech is a corpus of approximately 1000 hours of 16Khz read English speech derived from read audiobooks from the LibriVox project.
trw: لیبری سپیچ اے زر گھینآ سی 16 کلو ہارٹز سی أنگریزی می لیبری وکس سی پراجیکٹ ما آڈیو کتابا سی پوت تُھو۔

source: License
trw: لیسن

source: License: <licenseLink>CC-0</licenseLink>
trw: لیسن <licenseLink> سی سی 0 </licenseLink>

source: License: <licenseLink>{ $license }</licenseLink>
trw: لیسن <licenseLink>{ $license }</licenseLink>

source: Ligurian
trw: لیگوری

source: Lingala
trw: لینگالا

source: Link Copied
trw: لنک نقل کی

source: Links to websites that can help us understand the language
trw: اے جیِب سی بارا می ویب سائٹا سی لنکس تیندے مھو یے ایسی بارا می معلومات ہودی

source: Listen
trw: بُھوش

source: Listening
trw: بُھویُو

source: Listen options menu
trw: آپشنس سی مینو بُھویا

source: Listen-Queue
trw: بُھویُو سی ڇیِڙیِن

source: Lithuanian
trw: لُوتھینی

source: Loading…
trw: لوڈ ہودُو۔۔۔

source: Loading sentences…
trw: جملہ آخکارا ہودی خا۔۔۔

source: Localized
trw: ترجمہ کوئیل

source: Log In
trw: لاگ این

source: Login Identity
trw: لاگ این سی شناخت

source: <loginLink>Login</loginLink> or <loginLink>sign up</loginLink> to add multiple sentences
trw: <loginLink> لھنگا </loginLink>یا <loginLink> آمن اول گونأ مھید کے لھنگا </loginLink> آں ایک ما چیر جملہ مھید کے تھلا

source: Log in or sign up to get started
trw: مے سائسٹ کے لھنگا یا ای می میلدے شروع کوا

source: Log In / Sign Up
trw: ویب سائٹ کے لھنگا یا ای می آمن کے پوت سوا

source: Log In / Sign Up with { $company } email
trw: لاگ این /سائن این کمپنی سی { $company } ای میل دے

source: Log Out
trw: نُوخ

source: Lojban
trw: لوجبان

source: Look for text where the copyright no longer applies - for example most books that were published before 1920
trw: مھال مواد بُوا کامک می یأ کاپی رائیٹ سی مسلہ نہ ہودُو۔ مثلاً 1920 ما مُوش لیگیل کتاب

source: Looks like there aren't any clips to listen to in this language. Help us fill the queue by recording some now.
trw: مھامُور معلوم ہودُو یرأ تُو کامے جیِب بُودُودا ای می کی کلپ نی چھی۔ نم کلپ ریکارڈ کیدے مے ڇیِڙین می تھلا۔

source: Luganda
trw: لُوگانڈا

source: Luxembourgish
trw: لوگزیمبوری

source: Macedonian
trw: مقدونی

source: Mada
trw: مدا

source: Maithili
trw: میتھیلی

source: Make sure the platform is recording before you start speaking, and that it only stops once you’re finished.
trw: آمن یقنیا یرأ تو کا شیئی می آواز کودُودا سے ریکاڑد کودُو آں سے تھلا ایِڑی ہودُو کے یأ تُو غلے ہُوو۔

source: Make sure the sentence meets the following criteria:
trw: حی پوت تھأدے بُو یرأ جملہ ٹین سی مے طریقہ سی کیا برابر تھی:

source: Make your submitted data as rich as possible by providing some anonymous demographic data. We de-identify all demographic data before making it public.
trw: تُنُو تھلیل مواد شییئ آں مزید غورا کؤ سی کیا آبادی سی متعلق دھأک معلومات تھلا۔ مھو آبادی سی بارا می ٹول معلومات خلگا سی کیا پدا کؤ ما مُوش گمنام کودی۔

source: Malagasy
trw: ملگسی

source: Malay
trw: ملے

source: Malayalam
trw: ملیالم

source: Male/Masculine
trw: ماݜ/ماڙأ

source: Maltese
trw: مالٹیسی

source: Manage Email Subscriptions
trw: ای میل سبسکریپشن مینیج کو

source: Manage Subscriptions
trw: تُنُو کیا سبسکریپشن مھید مینیج کو

source: Mapudungun
trw: ماپُودئنگان

source: Marathi
trw: مراٹھی

source: <mark>Check</mark>
trw: <mark> چیک </mark>

source: <mark>Data</mark>
trw: <mark>ڈیٹا</mark>

source: <mark>Prompt</mark>
trw: <mark> سیدھا </mark>

source: <mark>Respond</mark>
trw: <mark> جواب دا</mark>

source: <mark>Transcribe</mark>
trw: <mark> ٹرانسکرائب </mark>

source: <mark>Using CV for</mark><br/><mark>your research?</mark>
trw: تُنُو تحقیق کی کیا سی وی استعمال کؤ

source: <mark>We need</mark><br/><mark>your help!</mark>
trw: مھو یے تُھن مدد پکار تُھو۔

source: Matrix is an open, lightweight protocol for decentralized, real-time communication, and Mozilla's preferred open discussion platform.
trw: میٹرکس موزیلا سی اے پدا کوئیل، بأت مأدا سی کیا بُوڑ خلگا سی کیا پلیٹ فارم تھو۔

source: Maximum file size: 25 MB
trw: زیاد ما زیاد 25 ایم بی سی سیز سی فائلز

source: Maybe our <homepageLink>homepage</homepageLink> will help? To ask a question, please join the <matrixLink>Matrix community chat</matrixLink>, monitor site issues via <githubLink>GitHub</githubLink> or visit <discourseLink>our Discourse forums</discourseLink>.
trw: ہوبھادُو مُھن <homepageLink> گھن پاݜ </homepageLink> چھی مدد کویے؟ سُوال سی توَس کؤ سی کیا مے لنک <matrixLink> زید شامل ہُوا۔ کمیونیٹی ست بأ کؤ سی کیا </matrixLink>مے لنک زید دا، سائٹ سی مسلہ بُو سی کیا مھید <githubLink> گٹ ہب زید بُوا یا مے پوت <discourseLink> بُوا آں ای زید ڈسکورس فورم/بأدا سی پوت بُوا</discourseLink>

source: MB
trw: ایم بی

source: Mbo
trw: مبو

source: Meadow Mari
trw: میڈو ماری

source: Media and Entertainment
trw: میڈیا او گیت میت

source: Medumba
trw: میڈومبا

source: Meetei Lon
trw: میٹی لون

source: Message
trw: چاڑ، پیغام

source: Michoacán Mazahua
trw: میچاؤچان مزاہاؤ

source: Minimum sentences in file: 1000
trw: اے فائل می کم سی کم 1000 جملہ

source: [Mismatched content]
trw: ایک دیئی سیت نہ ݜیدُو۔ غلط مواد

source: Misreadings
trw: غلط پڑھاؤ کؤ

source: Missing an 's' at the end of a word.
trw: ٹیلگا سی آخر می حرف یا آواز دھردُو۔

source: Missing an <strong>'s'</strong> at the end of a word.
trw: ٹیگیل سی آخر می <strong>ی، ے، یی، </strong>اکثر ہڙیئدی۔

source: Missing 'A' or 'The' at the beginning of the recording.
trw: ٹیگیل سی اوّل می میس یا ایس کلہ کلہ بنا نہ بیی۔

source: Missing <strong>'A'</strong> or <strong>'The'</strong> at the beginning of the recording.
trw: أ شیئ <strong>ا </strong>یا <strong> یا</strong> ریکارڈنگ سی اول می اکثر ہڙئیدی۔

source: Missing the end of the last word by cutting off the recording too quickly.
trw: ہامُوڑ آخری ٹیگیل سی آخری پھیٹ اکثر ہڙیی کئی کلہ کلہ ریکارڈنگ شیرتے ایڑی کودی۔

source: Mixed
trw: مکس

source: Mokpwe
trw: موکپی

source: Moksha
trw: موکشا

source: Mongolian
trw: منگولی

source: More
trw: دئی

source: [More has been recorded than the required text]
trw: ای می کھیدیک پکار آشُو دا تی ما چیر ریکارڈ کوا گا۔

source: More languages coming soon
trw: دأل جیِب ہُم شیرتے مھید ہونیِن

source: Mossi
trw: موسی

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Common Voice, a project to help make voice recognition open and accessible to everyone.
trw: گھین گھین کامپنی کامے ڈیٹا استعمال کودیدا سے چیر عوام سی کیا نو ہودُو۔ مُھن خیال دے ایندے نم نم کم خراب ہودی۔ ایسی کیا مھو یے کامن وائس سی نام دے مے منصوبہ شروع کی۔ مھالے منصوبہ یرأ ہے ٹولا سی کیا ہویے

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Project Common Voice, a project to help make voice recognition open to everyone.
trw: گھین گھین کامپنی کامے ڈیٹا استعمال کودیدا سے چیر عوام سی کیا نو ہودُو۔ مُھن خیال دے ایندے نم نم کم خراب ہودی۔ ایسی کیا مھو یے کامن وائس سی نام دے مے منصوبہ شروع کی۔ مھالے منصوبہ یرأ ہے ٹولا سی کیا ہویے

source: Most recordings are of people talking in their natural voice. You can accept the occasional non-standard recording that is shouted, whispered, or obviously delivered in a ‘dramatic’ voice. Please reject sung recordings and those using a computer-synthesized voice.
trw: چیر ریکارڈنگ سے ہودی کامک می یأ خلگ تُنُو قدرتی طریقہ دے بأت کودیِدا۔ تھو کلہ کلہ تے نامناسبا ریکارنڈنگ ہُم گھِن بھادی کامے می یأمنے چیگا ہی، ٹُھوس ٹُھوس ہُوئی یا تیس کآں ڈرامائی آنداز تے ڈائلاگ می بنا گا۔ أرضی أ چھی یرأ شانگے دے بنیل یا مشین او کمپیوٹر سی بنیل ریکارڈنگ رد کوا۔

source: Mozilla Common Voice is an initiative to help teach machines how real people speak.
trw: کامن وائس موزیلا سی اے پروگرام تُھو تیندے مشینا یے بنا بیدُو یرأ خلگ کھأکأ بنَدی کی جیِب۔

source: Mozilla Common Voice is made possible by a diverse community of activists, linguists, data scientists, academics and software engineers from all over the world. The project is stewarded by the Mozilla Foundation.
trw: موزیلا کامن وائس سی مںصوبہ بُوڑ دُونیئی ما جیِبا سی کارکُنے، ڈیٹا سی سائنسدانے، علمی پوتا سی خلگے آں سوفٹ وئیر انجنئیرز یے سوادتُو۔ اے منصوبہ سی خذمت موزیلا فاؤنڈیشن کودُو۔

source: Mozilla Common Voice is the world’s most diverse crowdsourced open speech dataset - and we’re powered entirely by donations. It costs almost a million dollars a year to host the datasets and improve the platform for the 100+ language communities who rely on what we do. If you value open, inclusive data - <b>donate today!</b>
trw: موزیلا کامن وائس دُونیئ سی بُوڑے ما گھین ہر ایک سی کیا بأدا سی دیٹا سیٹ چھی آں مھو ٹول کم چندا یے کودی۔ ایک سو جیِبا سی کی مے ڈیٹا سیٹ اے کال سی ساتُو سی کیا دش لکھ ڈالرے ݜیدی آں ای می ای سی ٹیک کؤ ہُم تُھو۔ کو تھو یے ہامُوڑ ہر ایک سی کیا ڈیٹا سیٹ خوش چھیو مھیرے مھو یے تُنُو ڈیٹا دا</b>

source: Mozilla’s open source voice recognition engine Deep Speech can be used to build speech recognition applications. Read our <githubLink>Github overview</githubLink> or join the <discourseLink>DeepSpeech Discourse</discourseLink> to learn how to get started.
trw: موزیلا سی دیپ سپیچ ایجن ہر ایک سی کیا آوازا سی پیانُو سی کیا ایپلیکیشنز سوؤ م کم یدُو۔ مُھن <githubLink> گٹ ہب سی بارا می مھید بُوا </githubLink>مھید ڈیپ سپیچ ڈسکورس </discourseLink>بُوآ آں چھیِڙا یرأ ہے کھأکأ کام کودُو۔

source: Mutual accountability.
trw: ایک دیئی ما توَس/جواب دہی

source: n
trw: ن

source: N
trw: ن

source: N/A
trw: مھید پکار نُو تُھو

source: Name
trw: نام

source: Names of your language
trw: اے جیِب سی نام

source: Native Language
trw: بوپ دأدی جیِب

source: Nature and Environment
trw: قدرت سی او ماحول سی بارا می

source: Need help with the Sex or Gender changes?
trw: جنس یا صنف سی پیانُو می مدد پکار تُھو؟

source: Need some help with accent?
trw: لہجہ زید دھأک مدد پکار تُھو؟

source: Need some help with variants?
trw: جیِبا سی مختلف بنُو سی قسما زید دھأک مدد پکار تُھو؟

source: Need to download your data?
trw: تھو یے تُنو ڈیٹا سی ڈاؤنلوڈ کؤ پکار تُھو؟

source: Nepali
trw: نیپالی

source: New Language Launch
trw: نیم جیِب ای می تھلُو

source: News and Current Affairs
trw: خبر او مھیر سی حال احوال

source: Next
trw: مُوٹھکے

source: Ngiembon
trw: نیگبون

source: Nias
trw: نیاس

source: Nigerian Pidgin English
trw: نائجریئن انگلش پیڈجن

source: NKo
trw: نیکو

source: No
trw: نأ

source: [No ‘a’ in the original text]
trw: اصل ٹیکسٹ میں ”اے“ پکار نہ تُھو۔

source: <noCopyright>No copyright</noCopyright> restrictions (cc-0)
trw: <noCopyright> کاپی رایئٹس، </noCopyright>کاپی رائٹسا سی پابندی

source: No foreign letters
trw: دیئی جیِب سی حروف نہ تھلا

source: No gravatar found for your email
trw: کی گریویٹار پا نہ گا چھی ای میل سیت

source: No information
trw: کی معلوم نُو تُھو؟

source: No information available
trw: کی معلومات نی تھی

source: No microphone found.
trw: مھو یے مائکروفون نہ پاد۔

source: Non-binary
trw: جنس نامعلوم

source: No numbers and special characters
trw: ہندسہ او خاص نشان نہ تھلا

source: Northern Sotho
trw: شمالی ساتھو

source: Northwest Gbaya
trw: شمالی مغربی بایا

source: Norwegian Bokmål
trw: نارویجی بوکمال

source: Norwegian Nynorsk
trw: ناروی نینارسک

source: No sentences to review. <addLink>Add more sentences now!</addLink>
trw: دُوآر بُو سی کیا جملہ نی تھی۔ <addLink> دأل جملہ جم کو مھیرے۔ </addLink>

source: ⓘ Not all sentences and clips have Variant tags yet!
trw: بُوڑ جملا سی آں کلپا سی لا قسما سی پیانُو سی نخ لا نی تھی۔

source: Note: When set to 'Visible', this setting can be changed from the <profileLink>Profile page</profileLink>
trw: بُھش: کے یا پشؤ سی کیا برابر کیو أ سیٹنگ پروفائل لنک <profileLink> ما بدل ہویی

source: Note: You will still need to select between Speak or Listen to change contribution type.
trw: نوٹ: تھو یے بنُو سی یا بُھویُو سی بٹن سی دیؤ ہونیِن میسی کیا یرأ ہے کانٹریبیوشن کامک تُھو۔

source: Not Found
trw: نہ پاد

source: No Thanks
trw: نأ، مہربأنگی

source: No thanks, continue speaking
trw: نأ شکریہ، بنُو جاری ساد

source: No variant selected
trw: کی لہجہ تھو یے نا کارُو

source: Now that you know a little bit more about Common Voice, why not try it out? Click on the microphone icon to start reading sentences aloud. <br/><br/>If you prefer to review other people's voice contributions, click on the play icon. You’ll help confirm that recordings match the sentences written on screen.
trw: مھیرے تُو دھأک کامن وائس سی بارا می جنُو، تھلا کئی نأ اے کوشش کودُو؟ مائیکرو فون سی نخ زید کلک کیدے جملہ زُورا بن۔ <br/> کو تُو دآل خلگا سی آواز سی جائزہ گھینُو نیِمادو پلے سی نخ زید کلک کو۔ تأ مُھن مدد کونیِن یرأ کامے جملہ سکرین زید دیل تھیدا سے مے ریکارڈنگ سیت برابر تھی۔
